Функция СоздатьПечатнуюФорму(СтруктураЗаполнения) Экспорт  
	
	ТекДата = ТекущаяДата();
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("Макет");
	
	// Шапка
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка|КолонкиПрепарат");
	ОбластьШапка.Параметры.Заполнить(СтруктураЗаполнения);
	ТабДок.Вывести(ОбластьШапка);
	
	// Шапка таблицы
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкиПрепарат");
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	Если СтруктураЗаполнения.Аналог Тогда
		ОбластьШапкаТаблицы1 = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкиАналог");
		ТабДок.Присоединить(ОбластьШапкаТаблицы1);
	КонецЕсли;
	Если СтруктураЗаполнения.Дженерик Тогда
		ОбластьШапкаТаблицы2 = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкиДженерик");
		ТабДок.Присоединить(ОбластьШапкаТаблицы2);
	КонецЕсли;
	
	// Таблица
	Для каждого СтрокаТД Из СписокПрепаратов Цикл       
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка|КолонкиПрепарат");
		ОбластьСтрока.Параметры.Заполнить(СтрокаТД);
		ТабДок.Вывести(ОбластьСтрока);
		Если СтруктураЗаполнения.Аналог Тогда
			ОбластьСтрока1 = Макет.ПолучитьОбласть("Строка|КолонкиАналог");
			ОбластьСтрока1.Параметры.Заполнить(СтрокаТД);
			ТабДок.Присоединить(ОбластьСтрока1);
		КонецЕсли;
		Если СтруктураЗаполнения.Дженерик Тогда
			ОбластьСтрока2 = Макет.ПолучитьОбласть("Строка|КолонкиДженерик");
			ОбластьСтрока2.Параметры.Заполнить(СтрокаТД);
			ТабДок.Присоединить(ОбластьСтрока2);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТабДок;	 
	
КонецФункции	