#language: ru

@tree

Функционал: Первоначальный ввод НСИ

Как Разработчик я хочу
сделать  первоначальное заполнение базы
чтобы заняться любимой разработкой

Сценарий: Ввод одного препарата

Дано Я открыл новый сеанс TestClient или подключил уже существующий
И я закрываю все окна клиентского приложения
Когда В командном интерфейсе я выбираю 'Справочники' 'Препараты'
Тогда открылось окно 'Препараты'
И я нажимаю на кнопку с именем 'ФормаСоздать'
Тогда открылось окно 'Препараты (создание)'
И в поле с именем 'Наименование' я ввожу текст 'Первый препарат'
И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
И я жду закрытия окна 'Препараты (создание)' в течение 20 секунд
И я нажимаю на кнопку с именем 'ФормаСоздать'
Тогда открылось окно 'Препараты (создание)'
И в поле с именем 'Наименование' я ввожу текст 'Второй препарат'
И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
И я жду закрытия окна 'Препараты (создание)' в течение 20 секунд
